# Module-5-Pandas-Assignment

In [49]:
import pandas as pd

In [52]:
#1
def range_series(start=0, end=0):
    if(start==0 and end==0):
        return pd.Series(range(1, 11))
    if(start==5 and end==0):
        return pd.Series(range(5, 11))
    if(start==5 and end==10):
        return pd.Series(range(5, 16))

In [53]:
range_series()

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [54]:
range_series(5)

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [55]:
range_series(5, 10)

0      5
1      6
2      7
3      8
4      9
5     10
6     11
7     12
8     13
9     14
10    15
dtype: int64

In [6]:
#2
def create_dataframe(keys, values):
    df=pd.DataFrame(values, index=keys)
    return df.T

keys=['One', 'Two']
values=[['X', 'Y'], ['A', 'B']]
m=create_dataframe(keys, values)
m

  One Two
0   X   A
1   Y   B

In [7]:
#3
def add(df1, df2):
    df=pd.concat([df1, df2], axis=1, ignore_index=True)
    return df

In [8]:
add(m, n)

   0  1  2  3
0  X  A  X  A
1  Y  B  Y  B

In [11]:
#4
df=pd.read_csv('cars.csv')
df.describe()

,S.No,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,29.000000,32.000000,32.000000,32.000000,32.0000
mean,16.500000,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.674828,0.437500,0.406250,3.687500,2.8125
std,9.380832,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.780394,0.504016,0.498991,0.737804,1.6152
min,1.000000,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,8.750000,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.870000,0.000000,0.000000,3.000000,2.0000
50%,16.500000,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.420000,0.000000,0.000000,4.000000,2.0000
75%,24.250000,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.600000,1.000000,1.000000,4.000000,4.0000
max,32.000000,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

In [12]:
#5
def get_max_correlated_column(col, data):
    disc={}
    lis=[x for x in data.columns if data[x].dtypes==float]
    for i in lis:
        disc[i]=abs(data[col].corr(data[i]))
    return max(disc)

In [17]:
get_max_correlated_column('mpg', df)

'wt'